Bebox-system/app/views/backend/maintenances/_form.html.erb

                    <%= f.label :bebox_id, class: "" %>
                    <%= f.collection_select(:bebox_id, Bebox.all,:id, :reference,{}, {:class => "form-control btn btn-default dropdown-toggle"})%>
---
SELECT "beboxes".* FROM "beboxes"