Bebox-system/app/controllers/frontend/contacts_controller.rb

INSERT INTO "contacts" ("name", "surname", "company", "email", "Telephone", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
     @contact = Contact.new(contact_params)
     if @contact.save