Bebox-system/app/views/backend/beboxs/edit.html.erb

                    <%= f.label :customer_id, class: "" %>
                    <%= f.collection_select(:customer_id, Customer.all,:id, :name ,{}, {:class => "form-control btn btn-default dropdown-toggle"})%>
---
SELECT "customers".* FROM "customers"