app/controllers/backend/parts_controller.rb

  def index
    @part = Part.all
---
SELECT "parts".* FROM "parts"

  def create
    @part = Part.new(parts_params)
     if @part.save
---
INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "cabel iphone 6"], ["created_at", 2016-09-26 07:43:52 UTC], ["updated_at", 2016-09-26 07:43:52 UTC]]