Bebox-system/app/controllers/backend_controller.rb

SELECT "maintenances".* FROM "maintenances" WHERE "maintenances"."todo" = ?  [["todo", 1]]
SELECT "beboxes".* FROM "beboxes"
SELECT  "maintenances".* FROM "maintenances" WHERE "maintenances"."bebox_id" = ? ORDER BY "maintenances"."id" DESC LIMIT ?  [["bebox_id", 1], ["LIMIT", 1]]
---
	def index
        @maintenances= Maintenance.where(todo: "1").all
    	@tocall = []
    	beboxes = Bebox.all
    	beboxes.each do |bebox|
    		t = Time.now - 24.hours
    		puts t
    		if bebox.maintenances.last.present?