Bebox-system/app/controllers/backend/beboxs_controller.rb

INSERT INTO "beboxes" ("reference", "location", "category", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reference", "ggj 6567v7"], ["location", "Jobi"], ["category", 0], ["customer_id", 1], ["created_at", 2016-09-26 09:46:23 UTC], ["updated_at", 2016-09-26 09:46:23 UTC]]
---
    def create
     @bebox = Bebox.new(bebox_params)
     if @bebox.save