Bebox-system/app/controllers/backend/beboxs_controller.rb

SELECT "beboxes".* FROM "beboxes"
---
    def index
    	@bebox = Bebox.all

SELECT  "beboxes".* FROM "beboxes" WHERE "beboxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    	@bebox = Bebox.find(params[:id])

SELECT  "beboxes".* FROM "beboxes" WHERE "beboxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
    	@bebox = Bebox.find(params[:id])

SELECT  "beboxes".* FROM "beboxes" WHERE "beboxes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "beboxes" WHERE "beboxes"."id" = ?  [["id", 2]]
---
    def destroy
        @bebox = Bebox.find(params[:id])
        if @bebox.destroy