Bebox-system/app/controllers/backend/contacts_controller.rb

SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC
---
  def index
  	@contacts = Contact.all