Bebox-system/app/controllers/backend/customers_controller.rb

SELECT "customers".* FROM "customers"
---
	def index
		@customer = Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	 def edit
     	@customer = Customer.find(params[:id])