Bebox-system/app/controllers/backend/interventions_controller.rb

SELECT  "maintenances".* FROM "maintenances" WHERE "maintenances"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def new
		@maintenance = Maintenance.find(session[:maintenance])