Bebox-system/app/controllers/backend/maintenances_controller.rb

  def index
  	@maintenances = Maintenance.all
---
SELECT "maintenances".* FROM "maintenances" ORDER BY "maintenances"."created_at" DESC

  def create
      @maintenances = Maintenance.new(maintenances_params)
     if @maintenances.save
---
INSERT INTO "maintenances" ("category", "bebox_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category", 0], ["bebox_id", 4], ["created_at", 2016-09-26 07:23:10 UTC], ["updated_at", 2016-09-26 07:23:10 UTC]]

  def show
  	@maintenances = Maintenance.find(params[:id])
---
SELECT  "maintenances".* FROM "maintenances" WHERE "maintenances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
      @maintenances = Maintenance.find(params[:id])
      if @maintenances.update(maintenances_params)
---
SELECT  "maintenances".* FROM "maintenances" WHERE "maintenances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "maintenances" SET "note" = ?, "updated_at" = ? WHERE "maintenances"."id" = ?  [["note", "il n a pas rependu"], ["updated_at", 2016-09-26 07:23:22 UTC], ["id", 1]]